output-29b1c4e1-cpupinning/socialNetwork_vmux-emu_27vms_8rps_rep1.log
Running 1m test @ http://10.1.0.44:8080
  8 threads and 16 connections

  Thread calibration: mean lat.: 2.755ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 1.797ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.154ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.452ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.644ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.123ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.777ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.816ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.1.0.44:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.73ms    3.19ms   8.44ms   95.13%
    Req/Sec     1.10     10.67    90.00     98.93%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.12ms
 75.000%    2.64ms
 90.000%    4.38ms
 99.000%    8.44ms
 99.900%   48.42ms
 99.990%   48.42ms
 99.999%   48.42ms
100.000%   48.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.156     0.000000            1         1.00
       1.633     0.100000           45         1.11
       1.797     0.200000           87         1.25
       1.915     0.300000          130         1.43
       1.995     0.400000          173         1.67
       2.115     0.500000          216         2.00
       2.179     0.550000          238         2.22
       2.301     0.600000          259         2.50
       2.421     0.650000          282         2.86
       2.537     0.700000          302         3.33
       2.661     0.750000          324         4.00
       2.717     0.775000          336         4.44
       2.773     0.800000          345         5.00
       2.835     0.825000          357         5.71
       2.927     0.850000          367         6.67
       3.101     0.875000          378         8.00
       3.283     0.887500          383         8.89
       4.375     0.900000          388        10.00
       4.903     0.912500          394        11.43
       5.123     0.925000          399        13.33
       5.531     0.937500          405        16.00
       5.595     0.943750          407        17.78
       5.847     0.950000          410        20.00
       6.099     0.956250          413        22.86
       6.371     0.962500          415        26.67
       6.915     0.968750          418        32.00
       6.987     0.971875          419        35.56
       7.119     0.975000          421        40.00
       7.199     0.978125          422        45.71
       7.511     0.981250          423        53.33
       8.167     0.984375          425        64.00
       8.167     0.985938          425        71.11
       8.231     0.987500          426        80.00
       8.439     0.989062          427        91.43
       8.439     0.990625          427       106.67
       8.791     0.992188          428       128.00
       8.791     0.992969          428       142.22
      10.943     0.993750          429       160.00
      10.943     0.994531          429       182.86
      10.943     0.995313          429       213.33
      41.567     0.996094          430       256.00
      41.567     0.996484          430       284.44
      41.567     0.996875          430       320.00
      41.567     0.997266          430       365.71
      41.567     0.997656          430       426.67
      48.415     0.998047          431       512.00
      48.415     1.000000          431          inf
#[Mean    =        2.732, StdDeviation   =        3.185]
#[Max     =       48.384, Total count    =          431]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  530 requests in 1.03m, 106.57KB read
  Socket errors: connect 0, read 0, write 0, timeout 156
  Non-2xx or 3xx responses: 53
Requests/sec:      8.55  
Transfer/sec:      1.72KB
AUTOTEST_DONE